package com.technovalley.topic;

import java.util.HashMap;
import java.util.Map;

public class Utility {

    public static final String IS_AUDIO_FILE_EXIST = "isAudioFileExist";
    public static final String POEM_TITLE = "POEM_TITLE";

    public static final String HATTI_MA_TIM_TIM = "hatti_ma_tim_tim";
    public static final String AY_AY_CHAD_MAMA = "ay_ay_chad_mama";
    public static final String AY_RE_AY_TIYE = "ay_re_ay_tiye";
    public static final String KANA_BOGIR_SA = "kana_bogir_sa";
    public static final String NOTON_NOTON_PAYRA_GULO = "noton_noton_payra_gulo";
    public static final String MAMAR_BARI = "mamar_bari";
    public static final String AMADER_GRAM = "amader_gram";
    public static final String BAPU_RAM_SAPU_RE = "bapu_ram_sapu_re";
    public static final String HONHON_PONPON = "honhon_ponpon";
    public static final String AMADER_CHOTO_NODI = "amader_choto_nodi";
    public static final String AMAR_PON = "amar_pon";
    public static final String CHUTI = "chuti";
    public static final String ISCHA = "ischa";
    public static final String KHOKAR_SADH = "khokar_sadh";
    public static final String PARIBONA = "paribona";
    public static final String BORO_KE = "boro_ke";
    public static final String CHOTON_GHUMAY = "choton_ghumay";
    public static final String ADORSHO_CHELE = "adorsho_chele";
    public static final String GHUM_PARANI_MASHI_PISHI = "ghum_parani_mashi_pishi";

    public static Map<String, String[]> BANGLA_POEM_DETAILS_MAP = new HashMap<String, String[]>();

    public static void load_poem_details() {

        if (BANGLA_POEM_DETAILS_MAP == null || BANGLA_POEM_DETAILS_MAP.isEmpty()) {
            BANGLA_POEM_DETAILS_MAP = new HashMap<String, String[]>();

            BANGLA_POEM_DETAILS_MAP.put(HATTI_MA_TIM_TIM, new String[]{"হাট্টিমা টিম টিম", "রোকনুজ্জামান খান (দাদাভাই)", "হাট্টিমা টিম টিম", "তারা মাঠে পাড়ে ডিম,", "তাদের খাড়া দুটো শিং", "তারা হাট্টিমা টিম টিম।"});
            BANGLA_POEM_DETAILS_MAP.put(AY_AY_CHAD_MAMA, new String[]{"আয় আয় চাঁদ মামা", "প্রচলিত", "আয় আয় চাঁদ মামা", "টিপ দিয়ে যা,", "চাঁদের কপালে চাঁদ", "টিপ দিয়ে যা।\n", "মাছ কাঁটলে মুড়ো দিব", "ধান ভানলে কুঁড়ো দিব", "কালো গরুর দুধ দিব", "দুধ খাবার বাটি দিব,\n", "চাঁদের কপালে চাঁদ", "টিপ দিয়ে যা।\n"});
            BANGLA_POEM_DETAILS_MAP.put(AMADER_CHOTO_NODI, new String[]{"আমাদের ছোট নদী", "রবীন্দ্রনাথ ঠাকুর", "আমাদের ছোটো নদী চলে বাঁকে বাঁকে", "বৈশাখ মাসে তার হাঁটু জল থাকে।\n", "পার হয়ে যায় গরু, পার হয় গাড়ি,", "দুই ধার উঁচু তার, ঢালু তার পাড়ি।\n", "চিক্ চিক্ করে বালি, কোথা নাই কাদা,", "একধারে কাশবন ফুলে ফুলে সাদা;\n", "কিচিমিচি করে সেথা শালিকের ঝাঁক,", "রাতে ওঠে থেকে থেকে শেয়ালের হাঁক।\n", "(সংক্ষিপ্ত)\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(CHOTON_GHUMAY, new String[]{"ছোটন ঘুমায়", "সুফিয়া কামাল", "গোল কোরো না, গোল কোরো না", "ছোটন ঘুমায় খাটে,", "এই ঘুমকে কিনতে হল", "নওয়াব বাড়ির হাটে।\n", "সোনা নয় রুপা নয়", "দিলাম মোতির মালা,", "তাই তো ছোটন ঘুমিয়ে আছে", "ঘর করে উজালা।"});
            BANGLA_POEM_DETAILS_MAP.put(AY_RE_AY_TIYE, new String[]{"আয় রে আয় টিয়ে", "রবীন্দ্রনাথ ঠাকুর", "আয় রে আয় টিয়ে", "নায়ে ভরা দিয়ে", "না’ নিয়ে গেল বোয়াল মাছে", "তাই না দেখে ভোঁদড় নাচে", "ওরে ভোঁদড় ফিরে চা", "খোকার নাচন দেখে যা।"});
            BANGLA_POEM_DETAILS_MAP.put(AMAR_PON, new String[]{"আমার পণ", "মদন মোহন তর্কালঙ্কার", "সকালে উঠিয়া আমি মনে মনে বলি,", "সারাদিন আমি যেন ভাল হয়ে চলি।\n", "আদেশ করেন যাহা মোর গুরুজনে,", "আমি যেন সেই কাজ করি ভাল মনে।\n", "ভাইবোন সকলেরে যেন ভালবাসি,", "এক সাথে থাকি যেন সবে মিলেমিশি।\n", "ভাল ছেলেদের সাথে মিশে করি খেলা,", "পাঠের সময় যেন নাহি করি হেলা।\n", "সুখী যেন নাহি হই আর কারো দুখে,", "মিছে কথা কভু যেন নাহি আসে মুখে।\n", "সাবধানে যেন লোভ সামলিয়ে থাকি,", "কিছুতে কাহারে যেন নাহি দেই ফাঁকি।\n", "ঝগড়া না করি যেন কভু কারো সনে", "সকালে উঠিয়া এই বলি মনে মনে।\n\n\n\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(HONHON_PONPON, new String[]{"হনহন পনপন", "সুকুমার রায়", "চলে হনহন", "ছোটে পনপন,\n", "ঘোরে বনবন", "কাজে ঠনঠন,\n", "বায়ু শনশন", "শীতে কনকন,\n", "কাশি খনখন", "ফোঁড়া টনটন,\n", "মাছি ভনভন", "থালা ঝন ঝন।\n"});
            BANGLA_POEM_DETAILS_MAP.put(MAMAR_BARI, new String[]{"মামার বাড়ি", "জসীম উদ্দীন", "আয় ছেলেরা আয় মেয়েরা", "ফুল তুলিতে যাই,", "ফুলের মালা গলায় দিয়ে", "মামার বাড়ি যাই।\n", "ঝড়ের দিনে মামার দেশে", "আম কুড়াতে সুখ,", "পাকা জামের শাখায় উঠি", "রঙিন করি মুখ।\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(KANA_BOGIR_SA, new String[]{"কানা বগীর ছা", "খান মুহাম্মদ মইনুদ্দীন", "ঐ দেখা যায় তাল গাছ", "ঐ আমাদের গাঁ।", " ঐ খানেতে বাস করে", " কানা বগীর ছা।\n", "ও বগী তুই খাস কি?", " পানতা ভাত চাস কি?\n", "পানতা আমি খাই না ", "পুঁটি মাছ পাই না,", "একটা যদি পাই ", "অমনি ধরে গাপুস গুপুস খাই।\n"});
            BANGLA_POEM_DETAILS_MAP.put(BORO_KE, new String[]{"বড় কে", "হরিশচন্দ্র মিত্র", "আপনারে বড় বলে, বড় সেই নয়", "লোকে যারে বড় বলে বড় সেই হয়।\n", "বড় হওয়া সংসারেতে কঠিন ব্যাপার", "সংসারে সে বড় হয়, বড় গুণ যার।\n", "গুণেতে হইলে বড়, বড় বলে সবে", "বড় যদি হতে চাও, ছোট হও তবে।\n"});
            BANGLA_POEM_DETAILS_MAP.put(CHUTI, new String[]{"ছুটি", "রবীন্দ্রনাথ ঠাকুর", "মেঘেরে কোলে রোদ হেসেছে", "বাদল গেছে টুটি,", "আজ আমাদের ছুটি ও ভাই", "আজ আমাদের ছুটি।\n", "কী করি আজ ভেবে না পাই", "পথ হারিয়ে কোন বনে যাই,", "কোন মাঠে যে ছুটে বেড়াই", "সকল ছেলে জুটি,\n", "আজ আমাদের ছুটি ও ভাই", "আজ আমাদের ছুটি।\n"});
            BANGLA_POEM_DETAILS_MAP.put(NOTON_NOTON_PAYRA_GULO, new String[]{"নোটন নোটন পায়রাগুলি", "রবীন্দ্রনাথ ঠাকুর", "নোটন নোটন পায়রাগুলি", "ঝোটন বেঁধেছে", "ওপারেতে ছেলেমেয়ে", "নাইতে নেমেছে।\n", "দুই ধারে দুই রুই কাতলা", "ভেসে উঠেছে", "কে দেখেছে কে দেখেছে", "দাদা দেখেছে", "দাদার হাতে কলম ছিল", "ছুঁড়ে মেরেছে", "উঃ বড্ড লেগেছে।\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(BAPU_RAM_SAPU_RE, new String[]{"বাবুরাম সাপুড়ে", "সুকুমার রায়", "বাবুরাম সাপুড়ে,", "কোথা যাস বাপুরে", "আয় বাবা দেখে যা,", "দুটো সাপ রেখে যা -\n", "যে সাপের চোখ নেই,", "শিং নেই, নোখ নেই,", "ছোটে না কি হাঁটে না,", "কাউকে যে কাটে না,", "করে না কো ফোঁসফাঁস", "মারে নাকো ঢুসঢাস,\n", "নেই কোন উৎপাত,", "খায় শুধু দুধভাত,", "সেই সাপ জ্যান্ত,", "গোটা দুই আন তো,", "তেড়ে মেরে ডাণ্ডা", "ক'রে দিই ঠাণ্ডা।\n\n\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(PARIBONA, new String[]{"পারিব না", "কালী প্রসন্ন ঘোষ", "পারিব না এ কথাটি বলিও না আর ", "কেন পারিবে না তাহা ভাব এক বার, ", "পাঁচজনে পারে যাহা, ", "তুমিও পারিবে তাহা, ", "পার কি না পার কর যতন আবার ", "এক বারে না পারিলে দেখ শত বার।\n", "পারিব না বলে মুখ করিও না ভার, ", "ও কথাটি মুখে যেন না শুনি তোমার, ", "অলস অবোধ যারা ", "কিছুই পারে না তারা,", "তোমায় তো দেখি নাক তাদের আকার ", "তবে কেন পারিব না বল বার বার?\n ", "জলে না নামিলে কেহ শিখে না সাঁতার ", "হাঁটিতে শিখে না কেহ না খেয়ে আছাড়, ", "সাঁতার শিখিতে হলে ", "আগে তব নাম জলে, ", "আছাড়ে করিয়া হেলা, হাঁট বার বার ", "পারিব বলিয় সুখে হও আগুয়ান।\n\n\n\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(KHOKAR_SADH, new String[]{"খোকার সাধ", "কাজী নজরুল ইসলাম", "আমি হব সকাল বেলার পাখি ", "সবার আগে কুসুম-বাগে উঠব আমি ডাকি।", "সূয্যিমামা জাগার আগে উঠব আমি জেগে,", "'হয়নি সকাল, ঘুমো এখন'- মা বলবেন রেগে।", "বলব আমি, 'আলসে মেয়ে ঘুমিয়ে তুমি থাক,", "হয়নি সকাল- তাই বলে কি সকাল হবে না কা!", "আমরা যদি না জাগি মা কেমনে সকাল হবে?", "তোমার ছেলে উঠলে গো মা রাত পোহাবে তবে!'\n", "ঊষা দিদির ওঠার আগে উঠব পাহাড়-চূড়ে,", "দেখব নিচে ঘুমায় শহর শীতের কাঁথা মুড়ে,", "ঘুমায় সাগর বালুচরে নদীর মোহনায়,", "বলব আমি 'ভোর হল যে, সাগর ছুটে আয়! ", "ঝর্ণা মাসি বলবে হাসি', 'খোকন এলি নাকি?'", "বলব আমি নই কো খোকন, ঘুম-জাগানো পাখি!'\n ", "ফুলের বনে ফুল ফোটাব, অন্ধকারে আলো,", "সূয্যিমামা বলবে উঠে, 'খোকন, ছিলে ভাল?'", "বলব 'মামা, কথা কওয়ার নাইক সময় আর,", "তোমার আলোর রথ চালিয়ে ভাঙব ঘুমের দ্বার।'", "রবির আগে চলব আমি ঘুম-ভাঙা গান গেয়ে,", "জাগবে সাগর, পাহাড় নদী, ঘুমের ছেলেমেয়ে!\n\n\n\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(AMADER_GRAM, new String[]{"আমাদের গ্রাম", "বন্দে আলী মিঞা", "আমাদের ছোটো গাঁয়ে ছোটো ছোটো ঘর ", "থাকি সেথা সবে মিলে কেহ নাহি পর। ", "পাড়ার সকল ছেলে মোরা ভাই ভাই ", "একসাথে খেলি আর পাঠশালে যাই। ", "হিংসা ও মারামারি কভু নাহি করি, ", "পিতা-মাতা গুরুজনে সদা মোরা ডরি। \n", "আমাদের ছোটো গ্রামে মায়ের সমান, ", "আলো দিয়ে বায়ু দিয়ে বাঁচাইছে প্রাণ। ", "মাঠভরা ধান আর জলভরা দিঘি, ", "চাঁদের কিরণ লেগে করে ঝিকিমিকি। ", "আমগাছ জামগাছ বাঁশ ঝাড় যেন, ", "মিলে মিশে আছে ওরা আত্মীয় হেন। ", "সকালে সোনার রবি পূব দিকে ওঠে ", "পাখি ডাকে, বায়ু বয়, নানা ফুল ফোটে ।\n\n\n\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(ISCHA, new String[]{"ইচ্ছা", "আহসান হাবীব", "মনারে মনা কোথায় যাস?", "বিলের ধারে কাটব ঘাস।", "ঘাস কি হবে?", "বেচব কাল,", "চিকন সুতোর কিনব জাল।", "জাল কি হবে?", "নদীর বাঁকে", "মাছ ধরব ঝাঁকে ঝাঁকে।", "মাছ কি হবে?", "বেচব হাটে,", "কিনব শাড়ি পাটে পাটে।", "বোনকে দেব পাটের শাড়ি,", "মাকে দেব রঙ্গিন হাঁড়ি।\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(ADORSHO_CHELE, new String[]{"আদর্শ ছেলে", "কুসুমকুমারী দাশ", "আমাদের দেশে সেই ছেলে কবে হবে ", "কথায় না বড় হয়ে কাজে বড় হবে?\n", "মুখে হাসি বুকে বল, তেজে ভরা মন ", "'মানুষ হইতে হবে'- এই তার পণ।\n", "বিপদ আসিলে কাছে হও আগুয়ান ", "নাই কি শরীরে তব রক্ত, মাংস, প্রাণ? \n", " হাত পা সবারই আছে, মিছে কেন ভয়? ", "চেতনা রয়েছে যার, সে কি পড়ে রয়?\n", "সে ছেলে কে চাই বল, কথায় কথায় ", "আসে যার চোখে জল, মাথা ঘুরে যায়?\n", "মনে প্রাণে খাট সবে, শক্তি কর দান, ", "তোমরা 'মানুষ' হলে দেশের কল্যাণ।\n\n\n\n\n"});
            BANGLA_POEM_DETAILS_MAP.put(GHUM_PARANI_MASHI_PISHI, new String[]{"ঘুমপাড়ানী মাসি পিসি", "রবীন্দ্রনাথ ঠাকুর", "ঘুমপাড়ানী মাসি পিসি,", "মোদের বাড়ি এসো।", "খাট নাই পালং নাই,", "চোখ পেতে বোসো।\n", "বাটা ভরা পান দেব,", "গাল ভরে খেও।", "খোকার চোখে ঘুম নাই,", "ঘুম দিয়ে যেও।\n"});
        }
    }
}